In [1]:
import pandas as pd

In [4]:
ut= pd.read_csv("ut_spp.csv",sep=";")

In [5]:
ut.head()

               ut  x_norm  y_norm  offset_x  offset_y
0             NAN     NaN     NaN         0         0
1         UT BARR  0.4451  0.7152         0         0
2      UT BENFELD  0.5491  0.7420         0         0
3    UT BERNSTEIN     NaN     NaN         0         0
4  UT BISCHWILLER  0.7073  0.4134         0         0

In [11]:
nouvelle = {"ut" : "UT STRASBOURG FINKWI", "x_norm":0.6438, "y_norm": 0.5725,"offset_x":0,"offset_y":0 }
nouvelle2 = {"ut" : "UT STRASBOURG OUEST", "x_norm":0.6293, "y_norm": 0.5616,"offset_x":0,"offset_y":0 }

In [8]:
ut.loc[len(ut)] = nouvelle

In [9]:
ut.tail()

                      ut  x_norm  y_norm  offset_x  offset_y
46         UT WASSELONNE  0.4151  0.5280         0         0
47   UT WINGEN SUR MODER  0.3439  0.3094         0         0
48        UT WISSEMBOURG  0.7693  0.2042         0         0
49             UT WOERTH  0.6204  0.2838         0         0
50  UT STRASBOURG FINKWI  0.6438  0.5725         0         0

In [12]:
ut.loc[len(ut)] = nouvelle2

In [13]:
ut.tail()

                      ut  x_norm  y_norm  offset_x  offset_y
47   UT WINGEN SUR MODER  0.3439  0.3094         0         0
48        UT WISSEMBOURG  0.7693  0.2042         0         0
49             UT WOERTH  0.6204  0.2838         0         0
50  UT STRASBOURG FINKWI  0.6438  0.5725         0         0
51   UT STRASBOURG OUEST  0.6293  0.5616         0         0